""" Скрыть номе банковской карты"""
# Условие:
# На вход идёт строка с номером карты. Она может иметь внутри себя пробелы, что функция и должна предусматривать.
# Результат — 12 символов * и 4 последних символа от входной строки.
# Пример:
# hidecard("3459 0054 1234 6674") → ************6674
# hidecard("1234567890987654") → ************7654


# 1 solution
def hidden_numbers_1(str):
  rep = str.replace(' ', '')
  return '*' * len(rep[:-4]) + '' + rep[-4:]

print(hidden_numbers_1('3459 0054 1234 6674'))

# 2 solution
def hidden_numbers_1(str):
  return f'{"*" * 12}{str.replace(" ","")[-4:]}'

print(hidden_numbers_1('3459 0054 1234 6674'))

#######################################################################################3